In [1]:
import numpy as np
import pandas as pd

In [2]:
x=[1,2,3,4,88]
arr=np.array(x)

In [3]:
print(arr)

[ 1  2  3  4 88]

In [4]:
type(arr)

numpy.ndarray

In [5]:
y=[5,9.5,78,60,54]

In [6]:
m1=pd.Series(x)
print(m1)
m2=pd.Series(y)
print(m2)

0     1
1     2
2     3
3     4
4    88
dtype: int64
0     5.0
1     9.5
2    78.0
3    60.0
4    54.0
dtype: float64

In [7]:
d1={"name":["D","S","P"],
   "Mark":[80,65,85],
   "City":["bbsr","ctc","jk"]}
s1=pd.DataFrame(d1)
print(s1)

  name  Mark  City
0    D    80  bbsr
1    S    65   ctc
2    P    85    jk

In [8]:
#series with numpy linspace()
s2=pd.Series(np.linspace(1,50,15))
print(s2)

0      1.0
1      4.5
2      8.0
3     11.5
4     15.0
5     18.5
6     22.0
7     25.5
8     29.0
9     32.5
10    36.0
11    39.5
12    43.0
13    46.5
14    50.0
dtype: float64

In [9]:
pd.Series(range(10))

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [10]:
s3=pd.Series(range(1,10,3),index=[x for x in "ghd"])
print(s3)

g    1
h    4
d    7
dtype: int64

In [11]:
s3.index=['a','b','c']
print(s3)

a    1
b    4
c    7
dtype: int64

In [12]:
s3.column=['A','B']
print(s3)

a    1
b    4
c    7
dtype: int64

In [13]:
s3['b']

4

In [14]:
s3[2]

7

In [15]:
s4=np.arange(10,15)
s5=pd.Series(data=s4*3,index=s4)
print(s5)

10    30
11    33
12    36
13    39
14    42
dtype: int32

In [16]:
print(s3)
print('')
print(s5)

a    1
b    4
c    7
dtype: int64

10    30
11    33
12    36
13    39
14    42
dtype: int32

In [17]:
s6 = pd.concat([s3,s5],axis=0)
s6

a      1
b      4
c      7
10    30
11    33
12    36
13    39
14    42
dtype: int64

In [18]:
df1=pd.DataFrame(np.random.randn(5,5))
df1

          0         1         2         3         4
0 -1.413760  0.655396  0.778566  1.186812 -0.719104
1  1.676194 -0.514657 -0.535633 -0.795980 -0.142100
2  0.685473 -1.174357  0.513260 -1.405683 -0.355050
3  0.499918 -0.919483  1.360061 -1.302164  1.198081
4 -0.511595  1.156419  1.442561 -0.233049  0.555625

In [19]:
s1

  name  Mark  City
0    D    80  bbsr
1    S    65   ctc
2    P    85    jk

In [20]:
df1.index=['a','b','c','d','e']
df1.column=[1,2,3,4,5]

df1

C:\Users\Dell\AppData\Local\Temp/ipykernel_1420/1774479608.py:2: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df1.column=[1,2,3,4,5]

          0         1         2         3         4
a -1.413760  0.655396  0.778566  1.186812 -0.719104
b  1.676194 -0.514657 -0.535633 -0.795980 -0.142100
c  0.685473 -1.174357  0.513260 -1.405683 -0.355050
d  0.499918 -0.919483  1.360061 -1.302164  1.198081
e -0.511595  1.156419  1.442561 -0.233049  0.555625

In [21]:
df1

          0         1         2         3         4
a -1.413760  0.655396  0.778566  1.186812 -0.719104
b  1.676194 -0.514657 -0.535633 -0.795980 -0.142100
c  0.685473 -1.174357  0.513260 -1.405683 -0.355050
d  0.499918 -0.919483  1.360061 -1.302164  1.198081
e -0.511595  1.156419  1.442561 -0.233049  0.555625

In [22]:
df1[1][2]

-1.1743573670921437

In [23]:
df1[3][0]=8.87
df1

          0         1         2         3         4
a -1.413760  0.655396  0.778566  8.870000 -0.719104
b  1.676194 -0.514657 -0.535633 -0.795980 -0.142100
c  0.685473 -1.174357  0.513260 -1.405683 -0.355050
d  0.499918 -0.919483  1.360061 -1.302164  1.198081
e -0.511595  1.156419  1.442561 -0.233049  0.555625

In [24]:
df1[1]

a    0.655396
b   -0.514657
c   -1.174357
d   -0.919483
e    1.156419
Name: 1, dtype: float64

In [25]:
df1.head(2)

          0         1         2        3         4
a -1.413760  0.655396  0.778566  8.87000 -0.719104
b  1.676194 -0.514657 -0.535633 -0.79598 -0.142100

In [26]:
df1.tail(2)

          0         1         2         3         4
d  0.499918 -0.919483  1.360061 -1.302164  1.198081
e -0.511595  1.156419  1.442561 -0.233049  0.555625

In [27]:
df1.describe()

              0         1         2         3         4
count  5.000000  5.000000  5.000000  5.000000  5.000000
mean   0.187246 -0.159336  0.711763  1.026625  0.107490
std    1.184753  1.016039  0.799096  4.409268  0.766438
min   -1.413760 -1.174357 -0.535633 -1.405683 -0.719104
25%   -0.511595 -0.919483  0.513260 -1.302164 -0.355050
50%    0.499918 -0.514657  0.778566 -0.795980 -0.142100
75%    0.685473  0.655396  1.360061 -0.233049  0.555625
max    1.676194  1.156419  1.442561  8.870000  1.198081

In [28]:
type(s1)

pandas.core.frame.DataFrame

In [29]:
type(df1[1])

pandas.core.series.Series

In [30]:
df1.loc['c']

0    0.685473
1   -1.174357
2    0.513260
3   -1.405683
4   -0.355050
Name: c, dtype: float64

In [31]:
df1.iloc[2]

0    0.685473
1   -1.174357
2    0.513260
3   -1.405683
4   -0.355050
Name: c, dtype: float64

In [32]:
df1

          0         1         2         3         4
a -1.413760  0.655396  0.778566  8.870000 -0.719104
b  1.676194 -0.514657 -0.535633 -0.795980 -0.142100
c  0.685473 -1.174357  0.513260 -1.405683 -0.355050
d  0.499918 -0.919483  1.360061 -1.302164  1.198081
e -0.511595  1.156419  1.442561 -0.233049  0.555625

In [33]:
df1.loc[['c','d'],[2,3]]

          2         3
c  0.513260 -1.405683
d  1.360061 -1.302164

In [34]:
df1.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [35]:
df1.column

[1, 2, 3, 4, 5]

In [36]:
df1.T

          a         b         c         d         e
0 -1.413760  1.676194  0.685473  0.499918 -0.511595
1  0.655396 -0.514657 -1.174357 -0.919483  1.156419
2  0.778566 -0.535633  0.513260  1.360061  1.442561
3  8.870000 -0.795980 -1.405683 -1.302164 -0.233049
4 -0.719104 -0.142100 -0.355050  1.198081  0.555625

In [37]:
df2=df1.to_numpy()
df2

array([[-1.4137596 ,  0.65539609,  0.77856604,  8.87      , -0.71910411],
       [ 1.67619374, -0.51465676, -0.53563286, -0.79598   , -0.14210026],
       [ 0.68547324, -1.17435737,  0.51325976, -1.40568343, -0.35504989],
       [ 0.49991819, -0.9194826 ,  1.36006145, -1.30216371,  1.19808106],
       [-0.51159476,  1.15641891,  1.44256121, -0.23304869,  0.55562496]])

In [38]:
df1

          0         1         2         3         4
a -1.413760  0.655396  0.778566  8.870000 -0.719104
b  1.676194 -0.514657 -0.535633 -0.795980 -0.142100
c  0.685473 -1.174357  0.513260 -1.405683 -0.355050
d  0.499918 -0.919483  1.360061 -1.302164  1.198081
e -0.511595  1.156419  1.442561 -0.233049  0.555625

In [39]:
df1.sort_index(axis=1,ascending=False)

          4         3         2         1         0
a -0.719104  8.870000  0.778566  0.655396 -1.413760
b -0.142100 -0.795980 -0.535633 -0.514657  1.676194
c -0.355050 -1.405683  0.513260 -1.174357  0.685473
d  1.198081 -1.302164  1.360061 -0.919483  0.499918
e  0.555625 -0.233049  1.442561  1.156419 -0.511595

In [40]:
df1>0

       0      1      2      3      4
a  False   True   True   True  False
b   True  False  False  False  False
c   True  False   True  False  False
d   True  False   True  False   True
e  False   True   True  False   True

In [41]:
df1[df1>0]

          0         1         2     3         4
a       NaN  0.655396  0.778566  8.87       NaN
b  1.676194       NaN       NaN   NaN       NaN
c  0.685473       NaN  0.513260   NaN       NaN
d  0.499918       NaN  1.360061   NaN  1.198081
e       NaN  1.156419  1.442561   NaN  0.555625

In [42]:
df1[5]=np.random.randn(5,1)
df1

          0         1         2         3         4         5
a -1.413760  0.655396  0.778566  8.870000 -0.719104 -1.901392
b  1.676194 -0.514657 -0.535633 -0.795980 -0.142100  0.032151
c  0.685473 -1.174357  0.513260 -1.405683 -0.355050  1.238157
d  0.499918 -0.919483  1.360061 -1.302164  1.198081  0.787715
e -0.511595  1.156419  1.442561 -0.233049  0.555625 -1.091448

In [43]:
df1.drop([5],axis=1)

          0         1         2         3         4
a -1.413760  0.655396  0.778566  8.870000 -0.719104
b  1.676194 -0.514657 -0.535633 -0.795980 -0.142100
c  0.685473 -1.174357  0.513260 -1.405683 -0.355050
d  0.499918 -0.919483  1.360061 -1.302164  1.198081
e -0.511595  1.156419  1.442561 -0.233049  0.555625

In [44]:
df1.drop(['e'],axis=0)

          0         1         2         3         4         5
a -1.413760  0.655396  0.778566  8.870000 -0.719104 -1.901392
b  1.676194 -0.514657 -0.535633 -0.795980 -0.142100  0.032151
c  0.685473 -1.174357  0.513260 -1.405683 -0.355050  1.238157
d  0.499918 -0.919483  1.360061 -1.302164  1.198081  0.787715

In [45]:
df1.drop([3],axis=1,inplace=True)

In [46]:
df1

          0         1         2         4         5
a -1.413760  0.655396  0.778566 -0.719104 -1.901392
b  1.676194 -0.514657 -0.535633 -0.142100  0.032151
c  0.685473 -1.174357  0.513260 -0.355050  1.238157
d  0.499918 -0.919483  1.360061  1.198081  0.787715
e -0.511595  1.156419  1.442561  0.555625 -1.091448

In [47]:
df1

          0         1         2         4         5
a -1.413760  0.655396  0.778566 -0.719104 -1.901392
b  1.676194 -0.514657 -0.535633 -0.142100  0.032151
c  0.685473 -1.174357  0.513260 -0.355050  1.238157
d  0.499918 -0.919483  1.360061  1.198081  0.787715
e -0.511595  1.156419  1.442561  0.555625 -1.091448

In [48]:
df1.drop([2],axis=1,inplace=True)

In [49]:
df1

          0         1         4         5
a -1.413760  0.655396 -0.719104 -1.901392
b  1.676194 -0.514657 -0.142100  0.032151
c  0.685473 -1.174357 -0.355050  1.238157
d  0.499918 -0.919483  1.198081  0.787715
e -0.511595  1.156419  0.555625 -1.091448

In [50]:
df1.drop([5],axis=1)

          0         1         4
a -1.413760  0.655396 -0.719104
b  1.676194 -0.514657 -0.142100
c  0.685473 -1.174357 -0.355050
d  0.499918 -0.919483  1.198081
e -0.511595  1.156419  0.555625

In [51]:
df1

          0         1         4         5
a -1.413760  0.655396 -0.719104 -1.901392
b  1.676194 -0.514657 -0.142100  0.032151
c  0.685473 -1.174357 -0.355050  1.238157
d  0.499918 -0.919483  1.198081  0.787715
e -0.511595  1.156419  0.555625 -1.091448

In [52]:
df1['new name']=['f','u','c','k','d']
df1

          0         1         4         5 new name
a -1.413760  0.655396 -0.719104 -1.901392        f
b  1.676194 -0.514657 -0.142100  0.032151        u
c  0.685473 -1.174357 -0.355050  1.238157        c
d  0.499918 -0.919483  1.198081  0.787715        k
e -0.511595  1.156419  0.555625 -1.091448        d

In [53]:
df1.set_index('new name')

                 0         1         4         5
new name
f        -1.413760  0.655396 -0.719104 -1.901392
u         1.676194 -0.514657 -0.142100  0.032151
c         0.685473 -1.174357 -0.355050  1.238157
k         0.499918 -0.919483  1.198081  0.787715
d        -0.511595  1.156419  0.555625 -1.091448

In [54]:
df1.drop(['new name'],axis=1,inplace=True)

In [55]:
df1

          0         1         4         5
a -1.413760  0.655396 -0.719104 -1.901392
b  1.676194 -0.514657 -0.142100  0.032151
c  0.685473 -1.174357 -0.355050  1.238157
d  0.499918 -0.919483  1.198081  0.787715
e -0.511595  1.156419  0.555625 -1.091448

In [56]:
df1[1].isnull()

a    False
b    False
c    False
d    False
e    False
Name: 1, dtype: bool

In [57]:
df1[1]=None

In [58]:
df1

          0     1         4         5
a -1.413760  None -0.719104 -1.901392
b  1.676194  None -0.142100  0.032151
c  0.685473  None -0.355050  1.238157
d  0.499918  None  1.198081  0.787715
e -0.511595  None  0.555625 -1.091448

In [59]:
df1[1].isnull()

a    True
b    True
c    True
d    True
e    True
Name: 1, dtype: bool

In [60]:
newdf = pd.DataFrame(np.random.rand(334,5), index= np.arange(334))

In [61]:
newdf.head()

          0         1         2         3         4
0  0.047412  0.042080  0.444732  0.385266  0.309086
1  0.578228  0.294116  0.446793  0.398599  0.556503
2  0.408294  0.158106  0.160020  0.209460  0.396158
3  0.139203  0.712305  0.689086  0.955482  0.957433
4  0.121348  0.625283  0.325383  0.178638  0.753133

In [62]:
newdf

            0         1         2         3         4
0    0.047412  0.042080  0.444732  0.385266  0.309086
1    0.578228  0.294116  0.446793  0.398599  0.556503
2    0.408294  0.158106  0.160020  0.209460  0.396158
3    0.139203  0.712305  0.689086  0.955482  0.957433
4    0.121348  0.625283  0.325383  0.178638  0.753133
..        ...       ...       ...       ...       ...
329  0.991446  0.387833  0.612497  0.655558  0.441475
330  0.804842  0.292788  0.255788  0.209517  0.428905
331  0.814328  0.197922  0.009912  0.468225  0.660376
332  0.018689  0.988615  0.818009  0.071101  0.534218
333  0.619869  0.665627  0.233857  0.009739  0.919575

[334 rows x 5 columns]

In [63]:
type(newdf)

pandas.core.frame.DataFrame

In [64]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.489978    0.466831    0.518662    0.504561    0.505803
std      0.285798    0.297393    0.278417    0.290094    0.294248
min      0.000448    0.002011    0.003422    0.003653    0.002737
25%      0.239132    0.199274    0.290639    0.246970    0.230311
50%      0.496242    0.433712    0.525563    0.494085    0.531514
75%      0.732084    0.729172    0.734273    0.741746    0.753001
max      0.999993    0.995634    0.999326    0.999910    0.994758

In [65]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [66]:
newdf[0][0]="D"

In [67]:
newdf[0]

0             D
1      0.578228
2      0.408294
3      0.139203
4      0.121348
         ...
329    0.991446
330    0.804842
331    0.814328
332    0.018689
333    0.619869
Name: 0, Length: 334, dtype: object

In [68]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [69]:
newdf.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
           dtype='int64', length=334)

In [70]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [71]:
newdf.to_numpy

<bound method DataFrame.to_numpy of             0         1         2         3         4
0           D  0.042080  0.444732  0.385266  0.309086
1    0.578228  0.294116  0.446793  0.398599  0.556503
2    0.408294  0.158106  0.160020  0.209460  0.396158
3    0.139203  0.712305  0.689086  0.955482  0.957433
4    0.121348  0.625283  0.325383  0.178638  0.753133
..        ...       ...       ...       ...       ...
329  0.991446  0.387833  0.612497  0.655558  0.441475
330  0.804842  0.292788  0.255788  0.209517  0.428905
331  0.814328  0.197922  0.009912  0.468225  0.660376
332  0.018689  0.988615  0.818009  0.071101  0.534218
333  0.619869  0.665627  0.233857  0.009739  0.919575

[334 rows x 5 columns]>

In [72]:
newdf[0][0]=0.46

In [73]:
newdf.head()

          0         1         2         3         4
0      0.46  0.042080  0.444732  0.385266  0.309086
1  0.578228  0.294116  0.446793  0.398599  0.556503
2  0.408294  0.158106  0.160020  0.209460  0.396158
3  0.139203  0.712305  0.689086  0.955482  0.957433
4  0.121348  0.625283  0.325383  0.178638  0.753133

In [74]:
newdf.sort_index(axis=0, ascending=False)

            0         1         2         3         4
333  0.619869  0.665627  0.233857  0.009739  0.919575
332  0.018689  0.988615  0.818009  0.071101  0.534218
331  0.814328  0.197922  0.009912  0.468225  0.660376
330  0.804842  0.292788  0.255788  0.209517  0.428905
329  0.991446  0.387833  0.612497  0.655558  0.441475
..        ...       ...       ...       ...       ...
4    0.121348  0.625283  0.325383  0.178638  0.753133
3    0.139203  0.712305  0.689086  0.955482  0.957433
2    0.408294  0.158106  0.160020  0.209460  0.396158
1    0.578228  0.294116  0.446793  0.398599  0.556503
0        0.46  0.042080  0.444732  0.385266  0.309086

[334 rows x 5 columns]

In [75]:
newdf.sort_index(axis=1, ascending=False)

            4         3         2         1         0
0    0.309086  0.385266  0.444732  0.042080      0.46
1    0.556503  0.398599  0.446793  0.294116  0.578228
2    0.396158  0.209460  0.160020  0.158106  0.408294
3    0.957433  0.955482  0.689086  0.712305  0.139203
4    0.753133  0.178638  0.325383  0.625283  0.121348
..        ...       ...       ...       ...       ...
329  0.441475  0.655558  0.612497  0.387833  0.991446
330  0.428905  0.209517  0.255788  0.292788  0.804842
331  0.660376  0.468225  0.009912  0.197922  0.814328
332  0.534218  0.071101  0.818009  0.988615  0.018689
333  0.919575  0.009739  0.233857  0.665627  0.619869

[334 rows x 5 columns]

In [76]:
newdf.head()

          0         1         2         3         4
0      0.46  0.042080  0.444732  0.385266  0.309086
1  0.578228  0.294116  0.446793  0.398599  0.556503
2  0.408294  0.158106  0.160020  0.209460  0.396158
3  0.139203  0.712305  0.689086  0.955482  0.957433
4  0.121348  0.625283  0.325383  0.178638  0.753133

In [77]:
type(newdf[0])

pandas.core.series.Series

In [78]:
newdf2 = newdf

In [79]:
newdf.loc[[1,1],[2,2]]

          2         2
1  0.446793  0.446793
1  0.446793  0.446793

In [80]:
newdf.iloc[1,1]

0.29411597784283183

In [81]:
newdf.loc[[1,1],[2,2]]

          2         2
1  0.446793  0.446793
1  0.446793  0.446793

In [82]:
newdf.iloc[[1,1],[2,2]]

          2         2
1  0.446793  0.446793
1  0.446793  0.446793

In [83]:
newdf.head()

          0         1         2         3         4
0      0.46  0.042080  0.444732  0.385266  0.309086
1  0.578228  0.294116  0.446793  0.398599  0.556503
2  0.408294  0.158106  0.160020  0.209460  0.396158
3  0.139203  0.712305  0.689086  0.955482  0.957433
4  0.121348  0.625283  0.325383  0.178638  0.753133

In [84]:
newdf.drop(1)

            0         1         2         3         4
0        0.46  0.042080  0.444732  0.385266  0.309086
2    0.408294  0.158106  0.160020  0.209460  0.396158
3    0.139203  0.712305  0.689086  0.955482  0.957433
4    0.121348  0.625283  0.325383  0.178638  0.753133
5    0.286382  0.380735  0.331099  0.290671  0.160142
..        ...       ...       ...       ...       ...
329  0.991446  0.387833  0.612497  0.655558  0.441475
330  0.804842  0.292788  0.255788  0.209517  0.428905
331  0.814328  0.197922  0.009912  0.468225  0.660376
332  0.018689  0.988615  0.818009  0.071101  0.534218
333  0.619869  0.665627  0.233857  0.009739  0.919575

[333 rows x 5 columns]

In [85]:
newdf.reset_index(drop=True, inplace=True)

In [86]:
newdf.head()

          0         1         2         3         4
0      0.46  0.042080  0.444732  0.385266  0.309086
1  0.578228  0.294116  0.446793  0.398599  0.556503
2  0.408294  0.158106  0.160020  0.209460  0.396158
3  0.139203  0.712305  0.689086  0.955482  0.957433
4  0.121348  0.625283  0.325383  0.178638  0.753133

In [87]:
newdf[2].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
329    False
330    False
331    False
332    False
333    False
Name: 2, Length: 334, dtype: bool

In [88]:
newdf[2]=None

In [89]:
newdf[2].isnull()

0      True
1      True
2      True
3      True
4      True
       ...
329    True
330    True
331    True
332    True
333    True
Name: 2, Length: 334, dtype: bool

In [90]:
newdf.loc[:,[2]]=45

In [91]:
newdf

            0         1   2         3         4
0        0.46  0.042080  45  0.385266  0.309086
1    0.578228  0.294116  45  0.398599  0.556503
2    0.408294  0.158106  45  0.209460  0.396158
3    0.139203  0.712305  45  0.955482  0.957433
4    0.121348  0.625283  45  0.178638  0.753133
..        ...       ...  ..       ...       ...
329  0.991446  0.387833  45  0.655558  0.441475
330  0.804842  0.292788  45  0.209517  0.428905
331  0.814328  0.197922  45  0.468225  0.660376
332  0.018689  0.988615  45  0.071101  0.534218
333  0.619869  0.665627  45  0.009739  0.919575

[334 rows x 5 columns]

In [92]:
"""dcbdcw
dcvgudd
\wdcbidd
vusdndc
cvshbcjkdc
"""

'dcbdcw\ndcvgudd\n\\wdcbidd\nvusdndc\ncvshbcjkdc\n'

In [93]:
#ytghjwughj

In [94]:
a=10
b=4
print(a+b)

14